{
    "address_components": [
        {
            "long_name": "# 1D",
            "short_name": "# 1D",
            "types": [
                "subpremise"
            ]
        },
        {
            "long_name": "179",
            "short_name": "179",
            "types": [
                "street_number"
            ]
        },
        {
            "long_name": "East 93rd Street",
            "short_name": "E 93rd St",
            "types": [
                "route"
            ]
        },
        {
            "long_name": "Manhattan",
            "short_name": "Manhattan",
            "types": [
                "sublocality_level_1",
                "sublocality",
                "political"
            ]
        },
        {
            "long_name": "New York",
            "short_name": "New York",
            "types": [
                "locality",
                "political"
            ]
        },
        {
            "long_name": "New York County",
            "short_name": "New York County",
            "types": [
                "administrative_area_level_2",
                "political"
            ]
        },
        {
            "long_name": "New York",
            "short_name": "NY",
            "types": [
                "administrative_area_level_1",
                "political"
            ]
        },
        {
            "long_name": "United States",
            "short_name": "US",
            "types": [
                "country",
                "political"
            ]
        },
        {
            "long_name": "10128",
            "short_name": "10128",
            "types": [
                "postal_code"
            ]
        },
        {
            "long_name": "3983",
            "short_name": "3983",
            "types": [
                "postal_code_suffix"
            ]
        }
    ],
    "adr_address": "<span class=\"street-address\">179 E 93rd St # 1D</span>, <span class=\"locality\">New York</span>, <span class=\"region\">NY</span> <span class=\"postal-code\">10128-3983</span>, <span class=\"country-name\">USA</span>",
    "formatted_address": "179 E 93rd St # 1D, New York, NY 10128, USA",
    "formatted_phone_number": "(212) 579-0909",
    "geometry": {
        "location": {
            "lat": 40.783793,
            "lng": -73.951408
        },
        "viewport": {
            "northeast": {
                "lat": 40.7850471802915,
                "lng": -73.9501282697085
            },
            "southwest": {
                "lat": 40.7823492197085,
                "lng": -73.9528262302915
            }
        }
    },
    "icon": "https://maps.gstatic.com/mapfiles/place_api/icons/generic_business-71.png",
    "id": "cadb08a585d4860cd277137df8a4dfcaf1247f75",
    "international_phone_number": "+1 212-579-0909",
    "name": "Moss Realty",
    "place_id": "ChIJaZN_SKRYwokRfOgvjZjczU8",
    "plus_code": {
        "compound_code": "Q2MX+GC New York, United States",
        "global_code": "87G8Q2MX+GC"
    },
    "rating": 3.7,
    "reference": "ChIJaZN_SKRYwokRfOgvjZjczU8",
    "reviews": [
        {
            "author_name": "Asmara Aziz",
            "author_url": "https://www.google.com/maps/contrib/112804258428183374959/reviews",
            "language": "en",
            "profile_photo_url": "https://lh6.googleusercontent.com/-64wulqf6Dxc/AAAAAAAAAAI/AAAAAAAAAAA/ACHi3reF6A8lwKFMApMoAInBT_-YKbgozw/s128-c0x00000000-cc-rp-mo/photo.jpg",
            "rating": 5,
            "relative_time_description": "3 years ago",
            "text": "Moving to Manhattan with a roommate a year ago was hard enough but after meeting with 4 different agencies and seeing 19 apartments we finally were lucky to find Moss Realty.  Being recent grads we both needed something reasonable and affordable which is tough even in lower Harlem. Actually going through the approval process can be discouraging and to say they made our experience pleasant is an understatement so if I could give 6 stars here I would. They were a big help with the renewal options which we are dealing with now and that has compelled me to write this review. 6 STARS and well deserved.",
            "time": 1463833358
        },
        {
            "author_name": "Sonia Marrero",
            "author_url": "https://www.google.com/maps/contrib/102599005351767886271/reviews",
            "language": "en",
            "profile_photo_url": "https://lh4.googleusercontent.com/-S25ApoRcblU/AAAAAAAAAAI/AAAAAAAAABY/qjmQFdO466Q/s128-c0x00000000-cc-rp-mo/photo.jpg",
            "rating": 5,
            "relative_time_description": "3 years ago",
            "text": "I almost never take the time to write a review about anything but in a city with soaring rents and a ton of rude and rushing people I wanted to take a quick minute to rate my experience. Moss Realty helped my roommate and I secure a two bedroom apartment in December in lower west Harlem.  The apartment was decent and the building so far seems to be really well taken care of but what stood head and shoulders above anything we experienced (or some of our friends moving to the city for that matter) was the service. I'm originally from North Carolina so moving to New York was already daunting. I so appreciated how kind and accommodating they were and particularly helpful in making the lease signing process a smooth and dare I say happy one. :)  \nSonia",
            "time": 1452959705
        },
        {
            "author_name": "Jessica Seppala",
            "author_url": "https://www.google.com/maps/contrib/103646586849435004135/reviews",
            "language": "en",
            "profile_photo_url": "https://lh5.googleusercontent.com/-JSF073joLR0/AAAAAAAAAAI/AAAAAAAAAAA/ACHi3rfo3AyL13IDra8QlmGKv6-eLu40XQ/s128-c0x00000000-cc-rp-mo-ba3/photo.jpg",
            "rating": 1,
            "relative_time_description": "3 years ago",
            "text": "If you're considering Moss Realty in NYC, perhaps I can help you with your decision by informing you on what happened with me.\n\nOn Friday October 16th I came across an ad on Craigslist for a rent stabilized apartment in Harlem.  I had met the income and credit qualifications we proceeded.  On Wednesday October 21st I looked at the available apartment with Nigel Borel.  It was still in the process of being cleaned up from the previous tenant, but it was everything I wanted and needed.  I have been on very limited time where I resided and was supposed to have been out already.  He has been very aware of my time frame the entire time.  He told me it should be available by the following Wednesday.  \n\nIn the meantime I filled out the application and got any and all necessary paperwork together within a day or two and paid the $75 application fee.  On Wednesday October 28th, he called and congratulated me because I had been approved.  All I needed to do was put the deposit in their account to secure it to me and take it off the market.  I did so within a few hours.  \n\nOver the next week and a half, when I would ask for updates when I could sign the lease and move he was dragging his feet and would only tell me that the management company or owner wasn't available.  I started to become concerned, clearly.  On Monday November 9th he asked me to call him.  He had informed me that the apartment was given to someone else.  Baffled because my deposit is supposed to secure it to me.  I was couting on it and he knew.  I was incredibly upset for a good reason.\n\nNigel assured me he had another apartment to get me into where the tenant wasn't moving out until the next week.  I didn't want that apartment, a studio with 437 noise complaints, but it was in my price and at that point there was nothing else I could do.  \n\nWhen I tried to get an understanding how this can happen all Nigel would tell me is that he understands.  Never gave me anymore information.  Due to this, on November 10th, I called the management company hoping to get some answers and to see if it was even legit anymore.  I don't remember the name of the nasty woman I spoke with but she told me the apartment I was inquiring about was rented out a long time ago.  Ok.  So I kept pushing for more information because things didn't add up.  She said they never even saw paperwork on me.  I never did tell her my name.  She kept telling me to talk to the broker.  I explained I'm not getting answers when I was promised this apartment.  She very rudely said, \"Oh my God, don't you speak English?!  Talk to your broker!\", in her broken accent.  \n\nAfter I hung up with the awful person representing their management, I called Nigel.  He already knew I called them and seemed furious and short with me as if he even has a right after screwing me over, stringing me along, lying and clearly breaking our contract and the law.\n\nDuring our last phone conversation he mentioned caring about his reputation.  I believe if you want to keep that good reputation, you not only keep your word but hold yourself accountable and follow through.  He told me he doesn't have time for a person who thinks he's scamming them.  I don't know what he was trying to pull, however, some type of fraud is how it appears whether is be bait n' switch or plain old stealing.  He's upset cause he didn't get away with it and expected me to be a naive Midwesterner.  \n\nFortunately a few days after that conversation he had the deposit put back into my account.  I never did get the application fee back.  \n\nEven after all that, I still gave him the chance to make it right by getting me into that studio but he began with the lies and stringing me along yet again and replying with short vague answers.  \n\nI gave up and it's been over a month since Nigel has contacted me.  I hope sharing my experience saves someone from the headache, time and money lost by avoiding Moss Realty.\n",
            "time": 1451400363
        }
    ],
    "scope": "GOOGLE",
    "types": [
        "real_estate_agency",
        "point_of_interest",
        "establishment"
    ],
    "url": "https://maps.google.com/?cid=5750494846983858300",
    "user_ratings_total": 3,
    "utc_offset": -240,
    "vicinity": "179 East 93rd Street # 1D, New York"
}